Revit 2026 API

# GenericZoneCreate Method

---

**Note: This API is now obsolete.**

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Prefer createSketchBased instead.")]
public static GenericZone Create(
	Document doc,
	string name,
	GenericZoneDomainData domainData,
	ElementId levelId,
	IList<CurveLoop> curveLoops
)
```
```vb
<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Prefer createSketchBased instead.")>
Public Shared Function Create (
	doc As Document,
	name As String,
	domainData As GenericZoneDomainData,
	levelId As ElementId,
	curveLoops As IList(Of CurveLoop)
) As GenericZone
```
```cpp
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Prefer createSketchBased instead.")]
static GenericZone^ Create(
	Document^ doc,
	String^ name,
	GenericZoneDomainData^ domainData,
	ElementId^ levelId,
	IList<CurveLoop^>^ curveLoops
)
```
```fsharp
[<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Prefer createSketchBased instead.")>]
static member Create :
        doc : Document *
        name : string *
        domainData : GenericZoneDomainData *
        levelId : ElementId *
        curveLoops : IList<CurveLoop> -> GenericZone
```

#### Parameters

doc Document

name String

domainData GenericZoneDomainData

levelId ElementId

curveLoops IListCurveLoop

#### Return Value

GenericZone

#### Reference

GenericZone Class

Autodesk.Revit.DB.Analysis Namespace